<?php
/**
 * Created by PhpStorm.
 * User: Denis
 * Date: 14.08.2019
 * Time: 14:44
 */
?>

<comment class="h4">
    "Завершите регистрацию автовладельца и принимайте заказы от наших клиентов-партнеров."
    <br><br>
</comment>

<p>
    Добавляйте Ваши транспортные средства и Ваших водителей в личном кабинеите
</p>
<p>
    Если Вы - ИП, добавьте его в разделе Юридические лица. Получайте расчет по заказам на р/с или банковскую карту.
</p>

<comment class="h4">
    "Памятка водителю формировалась и оттачивалась несколько лет.
    Она облегчит взаимодействие с Клиентами и исключит все спорные вопросы"
    <br><br>
</comment>
<p>
    Работа на результат, пунктуальность и аккуратность во всем позволит держать Ваш
    рейтинг водителя на максимуме. Что не может не сказаться на Ваших заказах и доходах.
</p>
<p>
    Благодаря Вашим оценкам и отзывам, недобросовестные Клиенты будут автоматически фильтроваться сервисом.
</p>

