<?php
/**
 * Created by PhpStorm.
 * User: Denis
 * Date: 14.08.2019
 * Time: 14:42
 */
?>

<comment class="h4">
    "Основная цель - органировать перевозку груза Клиента по минимальной цене."
    <br><br>
</comment>

<p>
    Мы работаем на рынке транспортных услуг с 2000 года ("ТА "Форсаж"). Основными критериями для нас всегда были надежность и партнерский подход.
</p>
<p>
    C развитием IT технологий у нас появилась возможность весь наш опыт вывести на новый уровень! То, что работало
    в "ручном" режиме десятилетия , благодаря нашему сервису получило "новую жизнь" с КПД в 10, 100 ... раз выше.
    <br>
</p>

<comment class="h4">
    "С помощью нашего сервиса можно как "перевезти холодильник",
    так и организовать работу отдела снабжения или сбыта крупного предприятия."
    <br><br>
</comment>
<p>
    Для Вашего удобства создан конструктор заказов. При первом использовании он может показаться сложным и "мудреным". Конечно, все уже
    давно привыкли к мобильным приложениям агрегаторов такси (Яндекс, Убер и др.). Пара нажатий и такси у Вашего адреса! Но не спешите сравнивать.
    Системы принципиально разные. Грузоперевозки - сложная и многоуровневая система. Поэтому "пара нажатий" не заработает.
    Конструктор создавался не один и не два месяца и будет постоянно совершенствоваться.
</p>
<p>
    По нашей статистике 50% клиентов - юридические лица. Которым важны не только стоимость и надежность, но и не в
     меньшей степени качество взаимодействия финансовых и логистических отделов. Удобный и быстрый документооборот.
    Минимальное время на поиск нужного ТС.
    Такие клиенты имеют возможность удобно с автозаполнением реквизитов добавлять в профиль юр. лица.
    Оформить Договор в 2 клика. Получать счета и акты за выполненные заказы в личный кабинет и на e-mail.
    Видеть статистику по каждому юр. лицу. И многое другое.
    <br><br>
</p>
<comment class="h4">
    "Мы не занимаемся попутными грузами и хранением"
    <br><br>
</comment>
<p>
    Вам больше не нужно "перелопачивать" авито и "из рук в руки", тратить время на обзвон Ваших быстро "стареющих баз".
</p>
<p>
    "Прозрачный", хоть и с первого взгляда "перегруженный" прайс лист работает на главную цель.
</p>
<p>
    Следите за специальными предложениями!
    <br><br>
</p>
<comment class="h4">
    "Система уведомлений позволяет следить за состоянием заказов."
    <br><br>
</comment>
<p>
    Пока у нас нет своего приложения для Android и iOS. Мы используем приложение push-all для отправки
    push уведомлений на мобильные устройства.
</p>
<p>
    Система оценок и отзывов позволяет оценивать не только выполненные заказы, но и
    другие действия водителей, как положительные, так и отрицательные (необоснованные отказы от
    уже принятых заказов и т.п.). Такой "естественный отбор" автоматически отфильтрует водителей-"не партнеров".
    Так же работает и в обратном направлении.
</p>