views/driver/_form.php

SELECT `id_country`, `name` FROM `country`
---
</div>
    <div class="col-lg-4">
        <h4>Паспортные данные</h4>
        <?= $form->field($DriverForm, 'country')->dropDownList(\yii\helpers\ArrayHelper::map(
            (($q = new \yii\db\Query())
                ->select(['id_country', 'name'])
                ->from('country')
                ->all()
            ), 'id_country', 'name'
        ), [
            'id' => 'countryPassportDwnList',
            'class' => 'btn btn-primary',

        ] )?>