Доброго времени суток, <?=$name?>!
<br><br>
Для Вас появился подходящий заказ № <?= $id_order?>!
<br><br>
Перед принятием внимательно изучите все его детали!
<br>
https://perevozki40.ru/order/vehicle
<br><br>
Важно!
Вам приходят уведомления только о заказах, подходящих под технические характеристики Ваших ТС
и под тарифы, которые Вы для них выбрали. Все эти данные Вы можете отредактировать в разделе
"Мой транспорт".
<br><br>
Процент принятых и выполненных Вами заказов от количества отправленных Вам уведомлений о новом заказе может
повлиять на Ваш рейтинг. Чем он меньше, тем больше падает Ваш рейтинг и наоборот.
<br><br>
Чтобы Вам не приходили лишние уведомления на дни, когда Ваши ТС заняты, регулярно пользуйтесь "Календарем занятости ТС"
https://perevozki40.ru/vehicle/calendar
<br><br>
Если Вам еще не приходят PUSH-уведомления на Ваш смартфон или планшет, Вы можете подписаться на них
на Вашей странице профиля https://perevozki40.ru/user.
Подробная видеоинструкция на нашем канале https://youtu.be/JlzyTWkNM8g.



