Доброго времени суток, <?= $name?>!

Для Вас появился подходящий заказ № <?= $id_order?>!

Важно!
Вам приходят уведомления только о заказах, подходящих под технические характеристики Ваших ТС
и под тарифы, которые Вы для них выбрали. Все эти данные Вы можете отредактировать в разделе
"Мой транспорт".

Процент принятых и выполненных Вами заказов от количества отправленных Вам уведомлений о новом заказе может
повлиять на Ваш рейтинг. Чем он меньше, тем больше падает Ваш рейтинг и наоборот.

Чтобы Вам не приходили лишние уведомления на дни, когда Ваши ТС заняты, регулярно пользуйтесь "Календарем занятости ТС"
https://perevozki40.ru/vehicle/calendar

Если Вам еще не приходят PUSH-уведомления на Ваш смартфон или планшет, Вы можете подписаться на них
на Вашей странице профиля https://perevozki40.ru/user. Подробная инструкция, как это сделать, скоро появится на сайте.