views/user/index.php

                <comment>Все личные данные клиентов хранятся в зашифрованном виде! Водители в первую очередь принимают заказы от Клиентов, с наиболее полной информацией в профиле (При аозможности
                    заполняйте все поля!) и наивысшим рейтингом.</comment>
                <br><br>
                <?= $form->field($UpdateUserProfileForm, 'country')->dropDownList(\yii\helpers\ArrayHelper::map(
                    (($q = new \yii\db\Query())
                        ->select(['id_country', 'name'])
                        ->from('country')
                        ->all()
                    ), 'id_country', 'name'
                ), [
                    'id' => 'countryPassportDwnList',
                    'class' => 'btn btn-primary',
                    'disabled' => true
                ] )?>
---
SELECT `id_country`, `name` FROM `country`