views/order/create.php

    <?php
        $form = myActiveForm::begin();
    ?>
    <?= $form->field($modelOrder, 'id_vehicle_type')->radioList(
            ArrayHelper::map(\app\models\VehicleType::find()->asArray()->all(), 'id', 'type')
    )->label($modelOrder->getAttributeLabel('id_vehicle_type'), ['withTip' => true])?>
---
SELECT * FROM `vehicle_type`