controllers/DriverController.php

SELECT * FROM `driver_licenses` WHERE `id`=43
---
    public function actionIndex($id_user = null, $redirect = null)
    {
        if(!$id_user) $id_user = Yii::$app->user->id;
        $modelProfile = Profile::findOne(['id_user' => $id_user]);
        if(!$modelProfile) return $this->redirect($redirect);

        $modelDriverLicense = $modelProfile->driverLicense;
        if(!$modelDriverLicense) $modelDriverLicense = new DriverLicense();

        $searchModel = new DriverSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->query->where(['id_car_owner' => $id_user]);

        if($modelProfile->load(Yii::$app->request->post()) && $modelDriverLicense->load(Yii::$app->request->post())){