controllers/UserController.php

SELECT * FROM `user` WHERE `id`=164
---
    public function actionIndex($redirect = '/user')
    {
        $modelUser = User::findOne(Yii::$app->user->identity->getId());