views/vehicle/index.php

SELECT * FROM `reg_licenses` WHERE `id`=158
SELECT * FROM `body_type` WHERE `id`=1
---
        'options' => [
            'style' => 'width: 70%;',
        ],
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],
            [
                'label' => 'Тарифные зоны',
                'format' => 'raw',
                'value' => function($model) {
                    return $model->idsListWithModalInfo;
                }
            ],
            'regLicense.brand',
            'regLicense.reg_number',
            [
                'label' => 'Грузоподъемность, т.',
                'contentOptions' => [
                    'style' => 'text-align: center;'
                ],
                'attribute' => 'tonnage'
            ],
            [
                'label' => 'Тип кузова',
                'value' => function($model){
                    return \app\models\BodyType::find()->where(['id' => $model->body_type])->one()->body;