models/setting/Setting.php

SELECT * FROM `setting`
---
    public static function getNoPhotoPath(){
        return Setting::find()->one()->noPhotoPath;