models/BodyType.php

   static public function getBodyTypies($id_vehicle_type, bool $any = false){
        $BTypies = BodyType::find()
            ->where(['id_type_vehicle' => $id_vehicle_type])
            ->orderBy(['id' => SORT_DESC])
        ;

        if($id_vehicle_type != Vehicle::TYPE_SPEC && $any){
            $BTypies = $BTypies ->orWhere(['id' => 0]);
        }

        return $BTypies->all();
---
SELECT * FROM `body_type` WHERE (`id_type_vehicle`='1') OR (`id`=0) ORDER BY `id` DESC