models/LoadingType.php

SELECT * FROM `loading_type`
---
    static public function getLoading_typies($id_vehicle_type){
        if($id_vehicle_type == Vehicle::TYPE_TRUCK){
            return self::find()->all();