models/Message.php

    public function sendPush(bool $save = true)
    {
        if ($push_ids = User::findOne($this->id_to_user)->push_ids) {
---
SELECT * FROM `user` WHERE `id`=164

        } else {
            $this->push_status = self::STATUS_NEED_TO_SEND;
        }
        if($save) $this->save();
---
INSERT INTO `message` (`id_to_user`, `title`, `text`, `url`, `push_status`, `email_status`, `can_review_client`, `can_review_vehicle`, `id_order`, `id_to_review`, `id_from_review`, `create_at`, `status`) VALUES (164, 'Заказ №22 изменен.', 'Спасибо за Ваш заказ.  <br>Заказ №22 на 28.08.2019 09:00<br>Маршрут: Россия, Калужская область, Боровский район, деревня Кабицыно <br>-  Россия, Калужская область, Бабынинский район, городское поселение Посёлок Воротынск, посёлок Воротынск <br>Приблизительный пробег: &asymp;198km <br><br>Тип ТС: Грузовой.<br> Тип(ы) кузова: Тент (сзади борт), Тент (сзади ворота), Бортовой (открытый)<br>Вес: 1.9 т. 1.3м * 1.7м * 1.1м  (Д*В*Ш). Объем: -- <br>Погрузка/разгрузка: Сзади, Сверху.. <br> <br>Тарифные зоны: 9, 10, 12. <br>Тип оплаты: Безналичный расчет . <br>Заказчик:Тест Тест Тест<br>Телефон: <a href = \"tel:+71111111111\">1111111111</a> <br>', 'http://test.loc/order/client', 1, 1, 0, 0, 22, NULL, NULL, 1566910707, 2)

    static public function countNewMessage($id_user){
        if(!$id_user) return null;
        $newMessages = Message::find()
            ->filterWhere(['id_to_user' => $id_user])
            ->orFilterWhere(['id_from_user' => $id_user])
            ->andWhere(['status' => self::STATUS_SEND])
            ->count();
---
SELECT COUNT(*) FROM `message` WHERE ((`id_to_user`=164) OR (`id_from_user`=164)) AND (`status`=2)