models/Order.php

SELECT * FROM `body_type` WHERE `id` IN ('4', '5', '18')
---
    public function afterSave($insert, $changedAttributes)
    {
        if($this->type_payment != Payment::TYPE_BANK_TRANSFER){
            $this->id_company = null;
        }

        if ($insert) {
            if(count($this->body_typies)) {
                foreach ($this->body_typies as $body_type_ld) {
                    if($body_type_ld) {
                        $BodyType = BodyType::findOne(['id' => $body_type_ld]);
                        if(!$this->hasBodyType($BodyType))
                            $this->link('bodyTypies', $BodyType);
                    }
                }
            }
            if(count($this->loading_typies)) {
                foreach ($this->loading_typies as $loading_type_id) {
                    if ($loading_type_id) { //что бы не сохранялся Любой
                        $LoadingType = LoadingType::findOne(['id' => $loading_type_id]);