models/Order.php

SELECT * FROM `price_zone` WHERE (`veh_type`=1) AND (`status`=1) AND (`tonnage_max` >= 1.9) AND (`length_max` >= 1.3) AND (`longlength`=0) ORDER BY `r_km`, `r_h`
---
    public function getSuitableRates($distance, int $limit = 10){
        $result = [];
        $priceZones = PriceZone::find()->where(['veh_type' => $this->id_vehicle_type])->andWhere(['status' => PriceZone::STATUS_ACTIVE]);

        switch ($this->id_vehicle_type) {
            case Vehicle::TYPE_TRUCK:
                $priceZones = $priceZones
                    ->andFilterWhere(['>=', 'tonnage_max', $this->tonnage])
                    ->andFilterWhere(['>=', 'volume_max', $this->volume])
                    ->andFilterWhere(['>=', 'length_max', $this->length]);
                if(!$this->longlength) {
                    $priceZones = $priceZones->andFilterWhere(['longlength' => $this->longlength]);
                }
//                    ->andFilterWhere(['longlength' => $this->longlength])
                $priceZones = $priceZones->orderBy(['r_km'=>SORT_ASC, 'r_h'=>SORT_ASC])
                    ->all()

SELECT * FROM `price_zone` WHERE `unique_index`=15
---
    public function getSuitableRatesCheckboxList($distance = null, $discount = null, $limit= 10){
        $suitable_rates = $this->getSuitableRates($distance, $limit);
        $return = [];
        foreach ($suitable_rates as $id => $suitable_rate){
            $PriceZone = PriceZone::findOne(['unique_index' => $id]);

SELECT * FROM `setting_client` LIMIT 1
SELECT * FROM `user` WHERE `id`=164
---
    public function getDiscount($user_id = null){
        if(!$this->type_payment) return 0;
        $type_payment = $this->type_payment;
        $SettingClient = SettingClient::find()->limit(1)->one();
        $discount_cash = 0;
        $discount_card = 0;
        if(!$user_id ) {
            $discount_cash = $SettingClient->not_registered_discount_cash;
            $discount_card = $SettingClient->not_registered_discount_card;
        } else {
            $user = User::findOne(['id' => $user_id]);

SELECT * FROM `body_type` WHERE `id`='4'
SELECT * FROM `loading_type` WHERE `id`='2'
SELECT * FROM `price_zone` WHERE `unique_index`='15'
---
    public function afterSave($insert, $changedAttributes)
    {
        if($this->type_payment != Payment::TYPE_BANK_TRANSFER){
            $this->id_company = null;
        }

        if ($insert) {
            if(count($this->body_typies)) {
                foreach ($this->body_typies as $body_type_ld) {
                    if($body_type_ld) {
                        $BodyType = BodyType::findOne(['id' => $body_type_ld]);
                        $this->link('bodyTypies', $BodyType);
                    }
                }
            }
            if(count($this->loading_typies)) {
                foreach ($this->loading_typies as $loading_type_id) {
                    if ($loading_type_id) { //что бы не сохранялся Любой
                        $LoadingType = LoadingType::findOne(['id' => $loading_type_id]);
                        $this->link('loadingTypies', $LoadingType);
                    }
                }
            }
            if($this->selected_rates) {
                foreach ($this->selected_rates as $selected_rate_uniqu_index) {
                    $PriceZone = PriceZone::findOne(['unique_index' => $selected_rate_uniqu_index]);

SELECT * FROM `body_type` WHERE `id`='4'
---
                $this->unlinkAll('bodyTypies', true);
                foreach ($this->body_typies as $body_type_ld) {
                    if($body_type_ld) {
                        $BodyType = BodyType::findOne(['id' => $body_type_ld]);

SELECT * FROM `body_type` WHERE `id` IN ('1', '2', '3', '4', '5', '6', '7', '18', '19')
SELECT * FROM `loading_type` WHERE `id`='2'
---
                $this->unlinkAll('loadingTypies', true);
                foreach ($this->loading_typies as $loading_type_id) {
                    if ($loading_type_id) { //что бы не сохранялся Любой
                        $LoadingType = LoadingType::findOne(['id' => $loading_type_id]);

SELECT * FROM `price_zone` WHERE `unique_index`='15'
---
            if($this->selected_rates) {
                $this->unlinkAll('priceZones', true);
                foreach ($this->selected_rates as $selected_rate_id) {
                    $PriceZone = PriceZone::findOne(['unique_index' => $selected_rate_id]);

SELECT * FROM `body_type` WHERE `id`='4'
SELECT * FROM `body_type` WHERE `id`=4
---
    public function getShortInfoForClient($Html = false, $finish = false){
        $return = 'Тип ТС: ' . $this->vehicleType->type .'.<br> Тип(ы) кузова: ';
        $bTypies =  '';
        if($finish){
            $bTypies .= $this->vehicle->bodyTypeText . ', ';
        } else {
            if(!$Html) {
                foreach ($this->body_typies as $bodyType) {
                    $bTypies .= BodyType::findOne($bodyType)->body . ', ';
                }
                $bTypies = substr($bTypies, 0, -2);
            } else {
                foreach ($this->body_typies as $bodyType) {
                    $bTypies .= BodyType::findOne($bodyType)->getBodyShortWithTip() . ', ';

SELECT * FROM `loading_type` WHERE `id`=2
---
                $return .= ($longlength)?' Груз-длинномер.<br>':'<br>';
                $lTypies = 'Погрузка/разгрузка: ';
                foreach ($this->loading_typies as $loadingType) {
                    $lTypies .= LoadingType::findOne($loadingType)->type . ', ';

SELECT * FROM `user` WHERE `id`=164
---
    public function changeStatus($newStatus, $id_client, $id_vehicle = null){
        if(!$id_client) return false;
        $url_client = Url::to(['/order/client'], true);
        $url_vehicle = Url::to(['/order/vehicle'], true);
        $email_from = Yii::$app->params['logistEmail'];
        $email_client = User::findOne($id_client)->email;

UPDATE `Orders` SET `update_at`=1566910680, `discount`=0 WHERE `id`=22
---

        $this->scenario = self::SCENARIO_UPDATE_STATUS;
        $this->status = $newStatus;
        $this->update_at = date('d.m.Y H:i', time());