models/PriceZone.php

SELECT * FROM `body_type` WHERE `id` IN ('18', '1', '19', '4', '5', '7', '6', '3', '2')
---
    public function getBodyTypies(){
        if($this->body_types){
            return BodyType::find()->where(['in', 'id', $this->body_types])->all();

SELECT * FROM `setting_vehicle` LIMIT 1
---
    public function getPriceZoneForCarOwner($id_car_owner = null){
        //можно добавить возможность менять процент в зависимости от роли, рейтинга и тд
        return $this->getWithDiscount(SettingVehicle::find()->limit(1)->one()->price_for_vehicle_procent);