models/Profile.php

    public function getBalanceClient(){
        $return = [
            'balance' => 0,
            'orders' => [],
            'payments' => [],
            'not_paid' => 0,
            'orders_not_paid' => [],
            'orders_avans' => [],
        ];

        $orders_cash = Order::find()->where(['id_user' => $this->id_user,])
            ->andWhere(['in', 'status', [Order::STATUS_CONFIRMED_VEHICLE, Order::STATUS_CONFIRMED_CLIENT]])
            ->andWhere(['type_payment' => Payment::TYPE_CASH])
            ->andWhere(['!=', 'id_car_owner', $this->id_user])
            ->all();
        $orders_card = Order::find()->where(['id_user' => $this->id_user,])
            ->andWhere(['in', 'status', [Order::STATUS_CONFIRMED_VEHICLE, Order::STATUS_CONFIRMED_CLIENT]])
            ->andWhere(['type_payment' => Payment::TYPE_SBERBANK_CARD])
            ->all();
        $payments = Payment::find()->where(['id_user' => $this->id_user])
            ->andWhere(['status' => Payment::STATUS_SUCCESS])
            ->andWhere(['calculation_with' => Payment::CALCULATION_WITH_CLIENT])
            ->andWhere(['id_user' => $this->id_user])
            ->andWhere(['<>', 'type', Payment::TYPE_BANK_TRANSFER])
            ->all();
---
SELECT * FROM `Orders` WHERE (`id_user`=164) AND (`status` IN (6, 7)) AND (`type_payment`=2)
SELECT * FROM `payment` WHERE (`id_user`=164) AND (`status`=1) AND (`calculation_with`=1) AND (`id_user`=164) AND (`type` <> 3)

    public function getBalanceCarOwner(){
        $return = [
            'balance' => 0,
            'orders' => [],
            'not_paid' => 0,
            'orders_not_paid' => [],
            'orders_avans' => [],

            'payments' => [],
        ];

        $orders = Order::find()->where(['id_car_owner' => $this->id_user,])
            ->andWhere(['in', 'status', [Order::STATUS_CONFIRMED_VEHICLE, Order::STATUS_CONFIRMED_CLIENT]])
            ->andWhere(['<>', 'type_payment', Payment::TYPE_CASH])
            ->andWhere(['paid_status' => Order::PAID_YES])
            ->all();
---
SELECT * FROM `Orders` WHERE (`id_car_owner`=164) AND (`status` IN (6, 7)) AND (`type_payment`=1) AND (`paid_status`=1)