models/Tip.php

    static public function getTipButtonModal($model, string $attr, array $ToggleButton = []){
        $Model = '';
        if(is_string($model)){
            $Model = $model;
        } else {
            $Model = $model->formName();
        }
        $tip = self::findOne(['model' => $Model, 'attribute' => $attr]);
---
SELECT * FROM `tip` WHERE (`model`='Order') AND (`attribute`='type_payment')