models/User.php

SELECT * FROM `user` WHERE `id`=164
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);