models/Vehicle.php

    public function getBrand(){
        return ($this && $this->regLicense)?
            Brand::find()->where(['id' => $this->regLicense->brand_id])->one()->brand:
---
SELECT * FROM `reg_licenses` WHERE `id`=159